<style type="text/css" media="screen">
/*
.nodes-image {
	margin:-100;
}
*/	
@import url("//maxcdn.bootstrapcdn.com/font-awesome/4.4.0/css/font-awesome.min.css");

.imageblock .content img, .image img {max-width: 900px;max-height: 300px;}
.deck h3, .deck h4 {display: block !important;margin-bottom:8px;margin-top:5px;}
.listingblock {margin:8px;}
.pull-bottom {position:relative;bottom:1em;}
.admonitionblock td.icon [class^="fa icon-"]{font-size:2.5em;text-shadow:1px 1px 2px rgba(0,0,0,.5);cursor:default}
.admonitionblock td.icon .icon-note:before{content:"\f05a";color:#19407c}
.admonitionblock td.icon .icon-tip:before{content:"\f0eb";text-shadow:1px 1px 2px rgba(155,155,0,.8);color:#111}
.admonitionblock td.icon .icon-warning:before{content:"\f071";color:#bf6900}
.admonitionblock td.icon .icon-caution:before{content:"\f06d";color:#bf3400}
.admonitionblock td.icon .icon-important:before{content:"\f06a";color:#bf0000}
.admonitionblock.note.speaker { display:none; }
</style>
<style type="text/css" media="screen">
/* #editor.maximize-editor .CodeMirror-code { font-size:24px; line-height:26px; } */
</style>
<article class="guide" ng-controller="AdLibDataController">
  <carousel class="deck container-fluid">
    <!--slide class="row-fluid">
      <div class="col-sm-3">
        <h3>Neo4j Connections: Graphs for Cybersecurity</h3>
        <p class="lead">Information</p>
			<!dl>
				
				
				
				
				
			</dl>
		</div>
      <div class="col-sm-9">
        <figure>
          <img style="width:300px" src=""/>
        </figure>
      </div>
    </slide-->
    


<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Neo4j Connections: Graphs for Cybersecurity</h3>
    <br/>
    <div>
      


   <h4>Background</h4>
   <div class="paragraph">
<p>Computer security, cybersecurity or information technology security (IT security) is the protection of computer systems and networks from information disclosure, theft of or damage to their hardware, software, or electronic data, as well as from the disruption or misdirection of the services they provide.</p>
</div>
<div class="paragraph">
<p>The field is becoming increasingly significant due to the continuously expanding reliance on computer systems, the Internet and wireless network standards such as Bluetooth and Wi-Fi, and due to the growth of "smart" devices, including smartphones, televisions, and the various devices that constitute the "Internet of things". Cybersecurity is also one of the significant challenges in the contemporary world, due to its complexity, both in terms of political usage and technology.</p>
</div>
<div class="paragraph">
<p>Losses attributed to cybercrime are expected to reach $10.5 trillion by 2025*, growing at a rate of 15 percent annually. Costs include damage and destruction of data, stolen money, theft of intellectual property, personal and financial data, investigation, restoration, and more. While the digital economy is flourishing, 68 percent of business leaders recognize their cybersecurity risks are also increasing, urging many to invest in the right tools. Gartner predicts the global information security market will reach a staggering $170.4 billion USD by 2022*.</p>
</div>
<div class="paragraph">
<p>Graph database can help in implementing an effective solution in the field of Cyber Security.</p>
</div>
<div class="paragraph">
<p>There is a quote from John Lambert, Engineer from Microsoft Threat Intelligence Center,
"Defenders think in lists. Attackers think in graphs. As long as this is true, attackers win."</p>
</div>
<div class="paragraph">
<p>Our networks are connected graphs. We can use a graph database based solution to have a holistic view of enterprise network.
This helps us quickly identify risks, detecting anomalies and protecting our systems and crown jewels with confidence to minimize impacts.</p>
</div>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Demo Use-case</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>This demo is based on the data and themes from the BloodHound project. Bloodhound is a great tool for auditing your active directory environment. It uses Neo4j Graph Database. We recommend looking into BloodHound or reading the very comprehensive handbook on it to learn more about Blood Hound.</p>
</div>
<div class="ulist">
<ul>
<li>
<p><a href="https://github.com/BloodHoundAD/BloodHound" target="_blank">BloodHound</a></p>
</li>
<li>
<p><a href="https://ernw.de/download/BloodHoundWorkshop/ERNW_DogWhispererHandbook.pdf" target="_blank">BloodHound Handbook</a></p>
</li>
</ul>
</div>
<div class="paragraph">
<p>We have conceptualized BloodHound example to prepare a fictitious Active Directory environment and showed some useful analysis.</p>
</div>
<div class="paragraph">
<p>Active directory helps IT teams monitor various network resources and users. It allows to grant and revoke different user permissions.</p>
</div>
<div class="paragraph">
<p>Active Directory comprises of various objects. We have considered below sample objects for this use cases.</p>
</div>
<div class="ulist">
<ul>
<li>
<p>User</p>
</li>
<li>
<p>Computer</p>
</li>
<li>
<p>Group</p>
</li>
<li>
<p>Domain</p>
</li>
<li>
<p>Group Policy Object (GPO) - Virtual Collection of Policy Settings</p>
</li>
<li>
<p>OU (Organization Unit) - Sub division</p>
</li>
</ul>
</div>
<div class="paragraph">
<p>Details:</p>
</div>
<div class="paragraph">
<p>Nodes 953 Relationships 4858</p>
</div>
<div class="imageblock">
<div class="content">
<img src="http://guides.neo4j.com/intro/img/model.svg" alt="model">
</div>
<div class="title">Figure 1. Model</div>
</div>



   <h4>Notes</h4>
   <div class="paragraph">
<p>In this demonstration, we have used Neo4j APOC (Awesome Procedures on Cypher) and Neo4j GDS (Graph Data Science) libraries few Cypher queries.
To execute the Cypher queries with APOC or GDS functions, you will need to add these libraries as plugins to your Neo4j database instance.</p>
</div>
<div class="paragraph">
<p>For more details on APOC and GDS, please refer below links.</p>
</div>
<div class="ulist">
<ul>
<li>
<p><a href="https://neo4j.com/developer/neo4j-apoc/" target="_blank">APOC</a></p>
</li>
<li>
<p><a href="https://neo4j.com/docs/graph-data-science/current/" target="_blank">GDS</a></p>
</li>
</ul>
</div>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Prepare the graph</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>We will first prepare the graph by preparing schema, loading nodes and relationships.</p>
</div>
<div class="paragraph">
<p>In order to load the graph data, you can use dump files available on Github repository of this example and follow data load process to load the graph.</p>
</div>
<div class="ulist">
<ul>
<li>
<p><a href="https://github.com/neo4j-graph-examples/graphs-for-cybersecurity/tree/main/data" target="_blank">Data Dump Files</a></p>
</li>
</ul>
</div>
<div class="paragraph">
<p>Alternatively, you can prepare schema, add constraints and use below Cypher query that uses APOC json load procedure to load json data.</p>
</div>
<div class="paragraph">
<p>Prepare Schema</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CREATE CONSTRAINT group_name IF NOT EXISTS ON (g:Group) ASSERT g.name IS UNIQUE;
CREATE CONSTRAINT domain_name IF NOT EXISTS ON (d:Domain) ASSERT d.name IS UNIQUE;
CREATE CONSTRAINT group_object_id IF NOT EXISTS ON (g:Group) ASSERT (g.objectid) IS UNIQUE;
CREATE CONSTRAINT ou_name IF NOT EXISTS ON (o:OU) ASSERT (o.name) IS UNIQUE;
CREATE CONSTRAINT domain_object_id IF NOT EXISTS ON (d:Domain) ASSERT (d.objectid) IS UNIQUE;
CREATE CONSTRAINT ou_object_id IF NOT EXISTS ON (o:OU) ASSERT (o.objectid) IS UNIQUE;
CREATE CONSTRAINT user_name IF NOT EXISTS ON (u:User) ASSERT (u.name) IS UNIQUE;
CREATE CONSTRAINT computer_objectid IF NOT EXISTS ON (c:Computer) ASSERT (c.objectid) IS UNIQUE;
CREATE CONSTRAINT computer_name IF NOT EXISTS ON (c:Computer) ASSERT (c.name) IS UNIQUE;
CREATE CONSTRAINT user_objectid IF NOT EXISTS ON (u:User) ASSERT (u.objectid) IS UNIQUE;
CREATE CONSTRAINT gpo_name IF NOT EXISTS ON (g:GPO) ASSERT (g.name) IS UNIQUE;<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>Import json data</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL apoc.import.json("https://gist.githubusercontent.com/chintan196/ac8107e8545ef91738812099ee9f1acf/raw/cd04ba54bf07b1065b5c30e25b90a68da2c76700/ad-data")<!--/code--></pre>
</div>
</div>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Test data with simple queries</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>We will test the graph with some simple queries to get network objects information.</p>
</div>
<div class="paragraph">
<p>List active sessions in the network.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->// Get the path where there is an active session relationship present and show all objects from path
MATCH p=()-[r:HAS_SESSION]-&gt;() RETURN p LIMIT 25<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>List all the machines where there are more than one active sessions running from different users.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->// Match computers and users which have active HAS_SESSION relationship
MATCH (u)&lt;-[:HAS_SESSION]-(c)
// Condition of more than one active user sessions (u) per computer (c)
WITH count(u) as sessionCount, c, collect(u.name) as users
WHERE sessionCount &gt; 1
RETURN c.name, users<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>Return all high value assets (we call them crownJewels) from the Network, also list what all groups, users have direct access to these high value objects</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->MATCH (o {highvalue:true})&lt;--(a)
WHERE a:User OR a:Group
RETURN o, a<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>Groups those have write (WRITE_OWNER) access to the domain object? Also find what all users have generic all access (full rights) from these groups</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->MATCH (d:Domain { name: 'TestCompany.Local' })&lt;-[:WRITE_OWNER]-(g:Group)
MATCH (g)-[:GENERIC_ALL]-&gt;(u:User)
RETURN d, g, u LIMIT 25<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>Get all users who have RDP access, and the computer where they the access.
Some Users have RDP access for self, some users have RDP access available through groups they are part of (inherited).</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL
{
// Get users who have direct RDP access to machines
MATCH p=(:User)-[:CAN_RDP]-&gt;(:Computer) RETURN p
UNION ALL
// Users who got RDP access via groups they are member of, this will check relationship levels upto 2 levels
MATCH p =(:User)-[:MEMBER_OF]-&gt;(:Group)-[:MEMBER_OF*0..2]-&gt;(:Group)-[:CAN_RDP]-&gt;(:Computer) RETURN p
}
// Return full paths
RETURN p LIMIT 50<!--/code--></pre>
</div>
</div>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Analyzing possible attack paths</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>Cyber security nowadays is seeing a zero trust shift of network defense. This approach allows organization to restrict access controls to network, apps and environment without sacrificing performance and user experience. Zero trust approach trusts on one.
Using Neo4j graph and its data science features, we can identify all possible threat paths (or attack paths) based on access. In a simple term, analyze any path that a user can take to reach to a high value resource in the network. Is this access (path) necessary?</p>
</div>
<div class="paragraph">
<p>Not necessary? These unwanted access paths can be revoked or controlled.</p>
</div>
<div class="paragraph">
<p>We are using the Dijkstra source target algorithm here.</p>
</div>
<div class="ulist">
<ul>
<li>
<p><a href="https://neo4j.com/docs/graph-data-science/current/algorithms/dijkstra-source-target/" target="_blank">Dijkstra Source-Target</a></p>
</li>
</ul>
</div>



   <h4>Prepare Graph</h4>
   <div class="paragraph">
<p>Below cypher will prepare an in memory graph projection for our analysis.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->// Build projection
CALL gds.graph.create.cypher("attackPaths",
    "MATCH (n) RETURN id(n) AS id",
    "MATCH (a)-[r]-&gt;(b) WHERE type(r) &lt;&gt; 'PATH' AND type(r) &lt;&gt; 'RAW_PATH' " +
    "  AND type(r) &lt;&gt; 'PATH_0' RETURN id(a) AS source, id(b) AS target"
);<!--/code--></pre>
</div>
</div>



   <h4>Preview attack paths</h4>
   <div class="paragraph">
<p>Here we generate all possibles path from normal objects to a high value object those might be exploited.</p>
</div>
<div class="paragraph">
<p>For example- What are possible paths from the user "<a href="mailto:PiedadFlatley255@TestCompany.Local">PiedadFlatley255@TestCompany.Local</a>" to the high value resources like Domain Controller and Domain Admin group?</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->MATCH (u:User {name:'PiedadFlatley255@TestCompany.Local' })
WITH u
// Targetting a high value object (crown jewel)
MATCH (crownJewel {highvalue:true})
WITH u, id(crownJewel) AS crownJewelId
// Get shortest paths from the user to the crown jewel object
CALL gds.shortestPath.dijkstra.stream("attackPaths", {
    sourceNode: id(u),
    targetNode: crownJewelId
}) YIELD path
RETURN path<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>Above preview query shows that the particular user in question can take numerous paths to reach Domain-Admin or Domain-Controller.</p>
</div>
<div class="imageblock">
<div class="content">
<img src="http://guides.neo4j.com/intro/img/attack-path-preview.svg" alt="attack path preview">
</div>
<div class="title">Figure 2. Attack paths from a user to a high value asset</div>
</div>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Materializing attack paths data</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>Like we saw for one user, what is the possible extent of this? We can check all the possible paths like this in whole network.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->// Targetting a high value object (crown jewel)
MATCH (crownJewel {objectid:'S-1-5-21-883232822-274137685-4173207997-512'})
WITH id(crownJewel) AS crownJewelId
// Match all normal non-high value objects
MATCH (n) WHERE n.highvalue IS NULL
WITH id(n) AS sourceId, crownJewelId
// Get shortest paths from all non high value objects to the crown jewel object
CALL gds.shortestPath.dijkstra.stream("attackPaths", {
    sourceNode: sourceId,
    targetNode: crownJewelId
}) YIELD sourceNode, targetNode, nodeIds
WITH nodeIds
// Pair one-one nodes from the path between crown jewel and normal object
UNWIND apoc.coll.pairsMin(gds.util.asNodes(nodeIds)) AS pair
WITH pair[0] AS a, pair[1] AS b
RETURN a.name, 'to', b.name LIMIT 10<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>In order to formalize this, for a possible risk mitigation,  we can materialize the attack paths by writing a relationship with name "ATTACK_PATH"</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->// Targetting a high value object (crown jewel)
MATCH (crownJewel {objectid:'S-1-5-21-883232822-274137685-4173207997-512'})
WITH id(crownJewel) AS crownJewelId
// Match all normal non-high value objects
MATCH (n) WHERE n.highvalue IS NULL
WITH id(n) AS sourceId, crownJewelId
// Get shortest paths from all non high value objects to the crown jewel object
CALL gds.shortestPath.dijkstra.stream("attackPaths", {
    sourceNode: sourceId,
    targetNode: crownJewelId
}) YIELD sourceNode, targetNode, nodeIds
WITH nodeIds
// Pair one-one nodes from the path between crown jewel and normal object
UNWIND apoc.coll.pairsMin(gds.util.asNodes(nodeIds)) AS pair
WITH pair[0] AS a, pair[1] AS b
// Relationship -  path leading from a normal object to a high value object
MERGE (a)-[r:ATTACK_PATH]-&gt;(b)
RETURN count(r);<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>Check ATTACK_PATHS.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->MATCH p=()-[r:ATTACK_PATH]-&gt;() RETURN p LIMIT 25<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>So we took every possible node in question, and we materialized a very specific link between them which repesents possible hops of attack paths.</p>
</div>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>More queries: Weights of nodes through the attack paths</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>We can apply more analytics to the data that we generated. We are going to use the different ATTACK_PATH relationships, we are going to project them into analytics graph projection, run it through betweenness algorithm.</p>
</div>
<div class="paragraph">
<p>Betweenness centrality is a way of detecting the amount of influence a node has over the flow of information in a graph. It is often used to find nodes that serve as a bridge from one part of a graph to another.</p>
</div>
<div class="paragraph">
<p>We will assign betweenness score to nodes on ATTACK_PATH. This score can help us in determining who from the nodes are heavy headers in attack paths.</p>
</div>
<div class="ulist">
<ul>
<li>
<p><a href="https://neo4j.com/docs/graph-data-science/current/algorithms/betweenness-centrality/" target="_blank">Betweenness Centrality</a></p>
</li>
</ul>
</div>
<div class="paragraph">
<p>First, we will create a in-memory graph projection for this.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL gds.graph.create('betweennessGraph', ['User', 'Group','Computer', 'Domain', 'GPO', 'OU'], 'ATTACK_PATH')<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>Second, we will estimate the memory usage for running this procedure on our projected data (nodes and relationships involved).</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL gds.betweenness.write.estimate('betweennessGraph', { writeProperty: 'betweenness' })
YIELD nodeCount, relationshipCount, bytesMin, bytesMax, requiredMemory<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>Third, we can run this procedure and stream results to see the weightage (betweenness score)</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL gds.betweenness.stream('betweennessGraph')
YIELD nodeId, score
WITH gds.util.asNode(nodeId) AS n, score
RETURN n.name, collect(labels(n)), score order by score desc limit 100<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>Fourth, we can materialize this weights data by writing them as properties on respective nodes. So we can perform some more analysis.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL gds.betweenness.write('betweennessGraph', { writeProperty: 'betweenness' })
YIELD centralityDistribution, nodePropertiesWritten<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>Finally, check users and groups which have much higher weights</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->MATCH (a)-[r:ATTACK_PATH]-&gt;(b)
WHERE a:User OR a:Group
RETURN a.name, labels(a), a.objectid, a.betweenness
ORDER BY a.betweenness DESCENDING LIMIT 25<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>You can also visualize the attack paths and heavy weighed nodes in Neo4j Bloom to have some visual analytics over this data.</p>
</div>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Clear attack paths</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>You can clear the attack paths and projection data using below cypher</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->// Drop graphs
CALL gds.graph.list() YIELD graphName
CALL gds.graph.drop(graphName) YIELD graphName AS dropped
RETURN count(*);

// Drop attack paths
MATCH ()-[r:ATTACK_PATH]-&gt;() DELETE r;<!--/code--></pre>
</div>
</div>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Next steps</h3>
    <br/>
    <div>
      


   <h4>Full Source Code Available on GitHub</h4>
   <div class="ulist">
<ul>
<li>
<p><a href="https://github.com/neo4j-graph-examples/graphs-for-cybersecurity" target="_blank">Source Code with Cypher and data dumps</a></p>
</li>
<li>
<p><a href="https://github.com/neo4j-graph-examples/" target="_blank">Other Example Datasets</a></p>
</li>
</ul>
</div>



   <h4>Demo video for this use case</h4>
   <div class="paragraph">
<p>This use case was presented on 31 Mar, 2021.</p>
</div>
<div class="ulist">
<ul>
<li>
<p><a href="https://www.youtube.com/watch?v=2O2JfqeHJR4" target="_blank">Demo Link</a></p>
</li>
</ul>
</div>



   <h4>More code</h4>
   <div class="ulist">
<ul>
<li>
<p><a play-topic="movie-graph">Movie Graph</a> - actors & movies</p>
</li>
<li>
<p><a play-topic="cypher">Cypher</a> - query language fundamentals</p>
</li>
</ul>
</div>



   <h4>References</h4>
   <div class="ulist">
<ul>
<li>
<p><a href="https://github.com/BloodHoundAD/BloodHound" target="_blank">BloodHound</a></p>
</li>
<li>
<p><a href="https://ernw.de/download/BloodHoundWorkshop/ERNW_DogWhispererHandbook.pdf" target="_blank">Handbook PDF</a></p>
</li>
<li>
<p><a href="https://en.wikipedia.org/wiki/Computer_security" target="_blank">Cyber Security- Wikipedia</a></p>
</li>
<li>
<p><a href="https://neo4j.com/docs/bloom-user-guide/current/bloom-perspectives/" target="_blank">Neo4j Bloom Persectives</a></p>
</li>
<li>
<p><a href="https://neo4j.com/press-releases/neo4j-for-cybersecurity/" target="_blank">Neo4j for Cyber Security</a></p>
</li>
<li>
<p><a href="https://cybersecurityventures.com/hackerpocalypse-cybercrime-report-2016/" target="_blank">Hackerpocalypse Cybercrime Report-2016</a></p>
</li>
<li>
<p><a href="https://www.accenture.com/_acnmedia/pdf-96/accenture-2019-cost-of-cybercrime-study-final.pdf" target="_blank">Cost of Cybercrime Study</a></p>
</li>
<li>
<p><a href="https://www.gartner.com/en/documents/3889055/forecast-analysis-information-security-worldwide-2q18-up" target="_blank">Forecast Analysis: Information Security, Worldwide</a></p>
</li>
<li>
<p><a href="https://github.com/JohnLaTwC/Shared/blob/master/Defenders%20think%20in%20lists.%20Attackers%20think%20in%20graphs.%20As%20long%20as%20this%20is%20true%2C%20attackers%20win.md" target="_blank">Functional Post - John Lambert</a></p>
</li>
<li>
<p><a href="https://github.com/voutilad/BloodHound-Tools/tree/update-to-neo4j4" target="_blank">BloodHound Datacreator Library</a></p>
</li>
</ul>
</div>
	</div>
  </div>
</slide>
  </carousel>
</article>